app/views/users/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
      <li>
        <%= order.orderType %>