app/controllers/groups_controller.rb

  def index
     @currentUser = current_user
     @groups = @currentUser.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "group_members" ON "groups"."id" = "group_members"."group_id" WHERE "group_members"."user_id" = $1  [["user_id", 2]]

  def friends
    @currentUser = current_user
    @friends = @currentUser.friends
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def add_friend
    @currentUser = current_user
    @group = Group.find(params[:group_id])
    @friend=User.find(params[:friend_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def list_member
    @group = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   def new
    @currentUser= current_user
    @group = @currentUser.groups.new
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 11]]

  def create
    @currentUser= current_user
    @group = @currentUser.groups.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "os"], ["user_id", 11], ["created_at", 2017-03-31 13:21:02 UTC], ["updated_at", 2017-03-31 13:21:02 UTC]]