app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders.all
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 4]]

  def create
    @order = current_user.orders.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("orderType", "restaurant", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["orderType", "lunch"], ["restaurant", "Gad"], ["status", "waiting"], ["user_id", 2], ["created_at", 2017-04-06 17:06:38 UTC], ["updated_at", 2017-04-06 17:06:38 UTC]]

  def finish
    @order=current_user.orders.find(params[:id])
    @orders = current_user.orders.all
    @order.update(status: "finish")
---
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 13], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "finish"], ["updated_at", 2017-04-06 18:39:25 UTC], ["id", 13]]

  def destroy
    @order.destroy
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 17]]

    def set_order
      @order = current_user.orders.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 17], ["LIMIT", 1]]