app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
  def index
    #to only show login user details
    @currentUser = current_user
    @users=User.all
    @orders=@currentUser.orders.all

INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "hind"], ["password", "iti"], ["email", "hind@gmail.com"], ["created_at", 2017-03-30 11:47:59 UTC], ["updated_at", 2017-03-30 11:47:59 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "encrypted_password" = $1, "image_uid" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["encrypted_password", "$2a$11$tMAuUWMsj08s/mn5LTK7vegFWxcWQIIGPQ6vxboHY6ilTg0UGJsD2"], ["image_uid", "2017/03/31/41acn9ui0n_2.png"], ["updated_at", 2017-03-31 09:34:04 UTC], ["id", 9]]
---
  def update
    respond_to do |format|
      if @currentUser.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_user
      @currentUser = User.find(params[:id])